docs/img/flows/compiled/sample_flow/flow.dot
digraph "sample_flow" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    end_sample_flow [label="end_sample_flow", fillcolor=palegreen];
    handler_finalize [label="handler_finalize", fillcolor=lightblue];
    handler_setup [label="handler_setup", fillcolor=lightblue];
    handler_type_a [label="handler_type_a", fillcolor=lightblue];
    handler_type_b [label="handler_type_b", fillcolor=lightblue];
    router_sample_flow_line_10_seq_2 [label="router_sample_flow_line_10_seq_2", fillcolor=wheat];
    router_sample_flow_line_5_if_3 [label="router_sample_flow_line_5_if_3", fillcolor=wheat];
    router_sample_flow_line_6_seq_1 [label="router_sample_flow_line_6_seq_1", fillcolor=wheat];
    start_sample_flow [label="start_sample_flow", fillcolor=palegreen];

    start_sample_flow -> handler_setup;
    handler_setup -> router_sample_flow_line_5_if_3;
    router_sample_flow_line_6_seq_1 -> handler_type_a;
    router_sample_flow_line_5_if_3 -> router_sample_flow_line_6_seq_1 [label="p['type'] == 'A'"];
    router_sample_flow_line_6_seq_1 -> handler_finalize;
    router_sample_flow_line_5_if_3 -> handler_type_b [label="not (p['type'] == 'A')"];
    handler_type_b -> router_sample_flow_line_10_seq_2;
    router_sample_flow_line_10_seq_2 -> handler_finalize;
    handler_finalize -> end_sample_flow;
}
